package com.javarush.test.level06.lesson11.bonus02;

import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;

/* Нужно добавить в программу новую функциональность
Задача: У каждой кошки есть имя и кошка-мама. Создать класс, который бы описывал данную ситуацию. Создать два объекта: кошку-дочь и кошку-маму. Вывести их на экран.
Новая задача: У каждой кошки есть имя, кошка-папа и кошка-мама. Изменить класс Cat так, чтобы он мог описать данную ситуацию.
Создать 6 объектов: маму, папу, сына, дочь, бабушку(мамина мама) и дедушку(папин папа).
Вывести их всех на экран в порядке: дедушка, бабушка, папа, мама, сын, дочь.

Пример ввода:
дедушка Вася
бабушка Мурка
папа Котофей
мама Василиса
сын Мурчик
дочь Пушинка

Пример вывода:
Cat name is дедушка Вася, no mother, no father
Cat name is бабушка Мурка, no mother, no father
Cat name is папа Котофей, no mother, father is дедушка Вася
Cat name is мама Василиса, mother is бабушка Мурка, no father
Cat name is сын Мурчик, mother is мама Василиса, father is папа Котофей
Cat name is дочь Пушинка, mother is мама Василиса, father is папа Котофей
*/

public class Solution
{
    public static void main(String[] args) throws IOException
    {
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));

/*
        Cat grandfather = new Cat(reader.readLine());
        Cat grandmother = new Cat(reader.readLine());
        Cat father = new Cat(reader.readLine(), null, grandfather);
        Cat mother = new Cat(reader.readLine(), grandmother, null);
        Cat son = new Cat(reader.readLine(), mother, father);
        Cat daughter = new Cat(reader.readLine(), mother, father);


        System.out.println(grandfather);
        System.out.println(grandmother);
        System.out.println(father);
        System.out.println(mother);
        System.out.println(son);
        System.out.println(daughter);
        */

        String grandFatherName = reader.readLine();
        Cat catGrandFather = new Cat(grandFatherName);

        String granMotherName = reader.readLine();
        Cat catGrandMother = new Cat(granMotherName);

        String fatherName = reader.readLine();
        Cat catFather = new Cat(fatherName,catGrandFather,null);

        String motherName = reader.readLine();
        Cat catMother = new Cat(motherName,null, catGrandMother);

        String sonName = reader.readLine();
        Cat catSon = new Cat(sonName, catFather, catMother);

        String daughterName = reader.readLine();
        Cat catDaughter = new Cat(daughterName, catFather, catMother);


        System.out.println(catGrandFather);
        System.out.println(catGrandMother);
        System.out.println(catFather);
        System.out.println(catMother);
        System.out.println(catSon);
        System.out.print(catDaughter);
    }



        public static class Cat
        {
            private String name;
            private Cat pap;
            private Cat mam;


            Cat(String name)
            {
                this.name = name;
            }

            Cat(String name, Cat pap, Cat mam)
            {
                this.name = name;
                this.pap = pap;
                this.mam = mam;
            }

            @Override
            public String toString()
            {
                if (mam == null && pap == null)
                    return "Cat name is " + name + ", no mother, no father";
                else if (mam == null)
                    return "Cat name is " + name + ", no mother" + ", father is " + pap.name;
                else if (pap == null)
                    return "Cat name is " + name + ", mother is " + mam.name + ", no father";
                else
                    return "Cat name is " + name + ", mother is " + mam.name + ", father is " + pap.name;
            }

    }

}
